package com.holybell.algorithm.binarysearch;

import java.util.Arrays;

/**
 * 难度：简单
 * <p>
 * 给定一个 n 个元素有序的（升序）整型数组 nums 和一个目标值 target ，
 * 写一个函数搜索 nums 中的 target，如果目标值存在返回下标，否则返回 -1。
 * <p>
 * 示例 1:
 * 输入: nums = [-1,0,3,5,9,12], target = 9
 * 输出: 4
 * 解释: 9 出现在 nums 中并且下标为 4
 * <p>
 * 示例 2:
 * 输入: nums = [-1,0,3,5,9,12], target = 2
 * 输出: -1
 * 解释: 2 不存在 nums 中因此返回 -1
 * <p>
 * 提示：
 * 你可以假设 nums 中的所有元素是不重复的。
 * n 将在 [1, 10000]之间。
 * nums 的每个元素都将在 [-9999, 9999]之间。
 */
public class LeetCode704_search {

    private static int _search(int[] nums, int target) {
        return -1;
    }

    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------

    /**
     * 通过二分查找在一个有序且不重复的数组中查询某个元素
     *
     * @param nums   有序，不重复数组
     * @param target 目标元素
     * @return 目标元素下标
     */
    private static int search(int[] nums, int target) {
        // 如果数组为空，直接返回-1
        if (nums == null || nums.length == 0) {
            return -1;
        }

        // 二分查找的左右指针
        // 注意这个右指针的选择范围将影响下面while条件，当right=nums.length-1的时候，搜索的范围是[left,right]，左闭右闭区间
        int left = 0, right = nums.length - 1;

        // left <= right 的终止循环条件为 left >= right + 1，结合上面的双闭区间，假设left=2,即[3,2]这个区间是终止条件，此区间没有剩余元素未被查询
        // 如果使用 left < right作为条件，则 left >= right 即为终止循环的条件，再次假设left=2，存在[2,2]这个区间是终止条件，很明显2这个下标未被查询   !!!!!
        while (left <= right) {
            int mid = left + (right - left) / 2;    // 这么做主要是为了防止数字过大溢出，不然直接（left+right）/2也是中间值
            // 找到目标，返回下标
            if (nums[mid] == target) {
                return mid;
            }
            // 发现中间值大于目标，那么应该将查询范围缩小到中间值的左侧区间，记住，这里使用的是双闭区间，因此此时的查找区间应为[left,mid-1]，因为mid已经判断过了
            else if (nums[mid] > target) {
                right = mid - 1;
            }
            // 发现中间值小于目标，那么应该将查询范围缩小到中间值的右侧区间，记住，这里使用的是双闭区间，因此此时的查找区间应为[mid+1,right]，因为mid已经判断过了
            else if (nums[mid] < target) {
                left = mid + 1;
            }
        }
        return -1;
    }

    /**
     * 通过二分查找在一个有序且不重复的数组中查询某个元素(主要和以上的解法做左闭右开区间的区别比较)
     *
     * @param nums   有序，不重复数组
     * @param target 目标元素
     * @return 目标元素下标
     */
    private static int searchV2(int[] nums, int target) {
        // 如果数组为空，直接返回-1
        if (nums == null || nums.length == 0) {
            return -1;
        }

        // 二分查找的左右指针
        // 注意这个右指针的选择范围将影响下面while条件，当right=nums.length-1的时候，搜索的范围是[left,right)，左闭右开区间
        int left = 0, right = nums.length;

        // 使用 left < right作为条件，则 left >= right 即为终止循环的条件，假设left=2，存在[2,2)这个区间是终止条件，很明显这个区间没有剩余元素未被检索
        while (left < right) {
            int mid = left + (right - left) / 2;    // 这么做主要是为了防止数字过大溢出，不然直接（left+right）/2也是中间值
            // 找到目标，返回下标
            if (nums[mid] == target) {
                return mid;
            }
            // 发现中间值大于目标，那么应该将查询范围缩小到中间值的左侧区间，记住，这里使用的是左闭右开区间，因此此时的查找区间应为[left,mid-1)，因为mid已经判断过了
            else if (nums[mid] > target) {
                right = mid;
            }
            // 发现中间值小于目标，那么应该将查询范围缩小到中间值的右侧区间，记住，这里使用的是左闭右开区间，因此此时的查找区间应为[mid+1,right)，因为mid已经判断过了
            else if (nums[mid] < target) {
                left = mid + 1;
            }
        }
        return -1;
    }

    // ---------------------------------------- 补充，在有重复集合中，查找目标数字的最左或者最优边界

    /**
     * 在可能有重复数字的有序集合中，查找某个目标数字最左边界位置
     *
     * @param nums   可能有重复数字的有序集合
     * @param target 目标数字
     */
    private static int searchLeft(int[] nums, int target) {
        // 提供的数组不合法，直接返回-1
        if (nums == null || nums.length == 0) {
            return -1;
        }

        int left = 0, right = nums.length - 1;  // 这样，二分查找的区间在[left,right]

        // 由于二分查找区间为双闭区间[left,right]，因此只有当left=right+1，即区间[right+1,right]，或者right=left-1，即区间[left,left-1]才没有未查找的位置
        while (left <= right) {
            int mid = left + (right - left) / 2;

            if (nums[mid] == target) {          // 查找到了目标数字，由于不确定当前数字是否为最左位置，尝试将查找区间的右边界缩小1继续查找该数字
                right = mid - 1;                // 双闭区间，因此取mid-1
            } else if (nums[mid] > target) {    // 和原先二分查找一致，中间值大于目标数字，则右边界回退1位
                right = mid - 1;                // 双闭区间，因此取mid+1
            } else if (nums[mid] < target) {    // 和原先二分查找一致，中间值小于目标数字，则左边界前进1位
                left = mid + 1;                 // 双闭区间，因此取mid-1
            }
        }

        // 由于终止条件为left = right+1， 或者 right = left -1
        // 这里取left作为最终返回结果，而left=right+1,right由数组最后一个位置开始回退，需要避免数组下标越界
        if (left >= nums.length || nums[left] != target) {
            return -1;
        }

        return left;
    }

    /**
     * 在可能有重复数字的有序集合中，查找某个目标数字最右边界位置
     *
     * @param nums   可能有重复数字的有序集合
     * @param target 目标数字
     */
    private static int searchRight(int[] nums, int target) {
        // 提供的数组不合法，直接返回-1
        if (nums == null || nums.length == 0) {
            return -1;
        }

        int left = 0, right = nums.length - 1;  // 这样，二分查找的区间在[left,right]

        // 由于二分查找区间为双闭区间[left,right]，因此只有当left=right+1，即区间[right+1,right]，或者right=left-1，即区间[left,left-1]才没有未查找的位置
        while (left <= right) {
            int mid = left + (right - left) / 2;

            if (nums[mid] == target) {          // 查找到了目标数字，由于不确定当前数字是否为最左位置，尝试将查找区间的左边界前进1位
                left = mid + 1;                // 双闭区间，因此取mid+1
            } else if (nums[mid] > target) {    // 和原先二分查找一致，中间值大于目标数字，则右边界回退1位
                right = mid - 1;                // 双闭区间，因此取mid+1
            } else if (nums[mid] < target) {    // 和原先二分查找一致，中间值小于目标数字，则左边界前进1位
                left = mid + 1;                 // 双闭区间，因此取mid-1
            }
        }

        // 由于终止条件为left = right+1， 或者 right = left -1
        // 这里取right,由于right=left-1,而left由数组起始位置0开始前进，需要避免right=0-1从而下标负数的情况
        if (right < 0 || nums[right] != target) {
            return -1;
        }

        return right;
    }

    public static void main(String[] args) {
        int[] nums = new int[]{-1, 0, 3, 5, 9, 12};
        int target = 9;
        System.out.println("你的答案:");
        System.out.println(_search(nums, target));
        System.out.println("------------------------->");
        System.out.println("正确答案:");
        System.out.println(search(nums, target));
        System.out.println("正确答案V2:");
        System.out.println(searchV2(nums, target));

        System.out.println("------------------------->扩展题目");
        nums = new int[]{-1, 0, 3, 3, 3, 3, 5, 5, 5, 9, 12};
        System.out.println("在数组" + Arrays.toString(nums) + "中,数字3最左边界为" + searchLeft(nums, 3));
        System.out.println("在数组" + Arrays.toString(nums) + "中,数字3最右边界为" + searchRight(nums, 3));
    }
}
