package com.holybell.algorithm.string;

/**
 * 难度:简单
 * 给定一个单词，你需要判断单词的大写使用是否正确。
 * 我们定义，在以下情况时，单词的大写用法是正确的：
 * <p>
 * <p>
 * 全部字母都是大写，比如"USA"。
 * 单词中所有字母都不是大写，比如"leetcode"。
 * 如果单词不只含有一个字母，只有首字母大写， 比如 "Google"。
 * <p>
 * <p>
 * 否则，我们定义这个单词没有正确使用大写字母。
 * <p>
 * 示例 1:
 * 输入: "USA"
 * 输出: True
 * <p>
 * <p>
 * 示例 2:
 * 输入: "FlaG"
 * 输出: False
 * <p>
 * <p>
 * 注意: 输入是由大写和小写拉丁字母组成的非空单词。
 * Related Topics 字符串
 */
public class LeetCode520_detectCapitalUse {

    public boolean detectCapitalUse(String word) {
        return false;
    }

    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------
    // --------------------------------------------------------------------

    public boolean detectCapitalUseV1(String word) {

        // 要么都是大写，要么首字母大写， 否则就得全部是小写  A-Z 属于 [65,90] a-z [97,122]

        // 题目指定字符串非空，无需额外判断

        char[] chs = word.toCharArray();

        int capitalCount = 0;
        // 标记首字母是否为大写字母
        boolean isFirstCapital = false;
        for (int i = 0; i < chs.length; i++) {

            // 判断首字母是否大写
            if (i == 0) {
                isFirstCapital = isCapitalCharacter(chs[i]);
            }

            // 统计大写字母个数
            if (isCapitalCharacter(chs[i])) {
                capitalCount++;
            }
        }

        // 首字母大写
        if (isFirstCapital) {
            // 正确使用大写字母的情况: ①全部大写，②剩下的全部小写
            if (capitalCount == chs.length || capitalCount == 1) {
                return true;
            }
        } else {
            // 首字母非大写
            // 正确使用大写字母的情况: ①全部小写
            return capitalCount == 0;
        }

        return false;
    }

    /**
     * 校验字符是否属于大写字母
     * 若不知道字符的ascii码，干脆使用一个HashSet记录A-Z之间的字符，然后判断字符是否存在集合
     */
    private boolean isCapitalCharacter(char ch) {
        return ch >= 65 && ch <= 90;
    }

    public static void main(String[] args) {
        LeetCode520_detectCapitalUse detectCapitalUse = new LeetCode520_detectCapitalUse();
        String str1 = "USA", str2 = "FlaG", str3 = "leetcode";
        System.out.println("你的答案:");
        System.out.println("字符串 : " + str1 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUse(str1));
        System.out.println("字符串 : " + str2 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUse(str2));
        System.out.println("字符串 : " + str3 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUse(str3));
        System.out.println("----------------------------------->");
        System.out.println("正确答案:");
        System.out.println("字符串 : " + str1 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUseV1(str1));
        System.out.println("字符串 : " + str2 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUseV1(str2));
        System.out.println("字符串 : " + str3 + " 是否正确使用大写字母 : " + detectCapitalUse.detectCapitalUseV1(str3));
    }


}
